armfly/H7-TOOL_STM32H7_App/User/programmer/stm8_flash.c
/*
*********************************************************************************************************
*
*    模块名称 : stm8系列flash访问程序
*    文件名称 : stm8_flash.c
*    版    本 : V1.0
*    说    明 : STM8 flash编程函数。根据STM8各个系列的固件库汇总而成。
*    修改记录 :
*        版本号  日期       作者    说明
*        V1.0    2020-02-08 armfly  原创。
*
*    Copyright (C), 2018-2030, 安富莱电子 www.armfly.com
*
*********************************************************************************************************
*/

#include "bsp.h"
#include "DAP_config.h"
#include "stm8_swim.h"
#include "stm8_flash.h"
#include "stm8.h"

///* STM8S 寄存器定义 */
//#define STM8_FLASH_OPT		    0x00004800
//#define STM8_FLASH_PUKR		    0x00005062
//#define STM8_FLASH_DUKR         0x00005064
//#define STM8_FLASH_CR2          0x0000505B
//#define STM8_FLASH_IAPSR        0x0000505f
//#define STM8_FLASH_FPR          0x0000505D
//#define CLK_SWIMCCR             0x000050CD
//#define SWIM_CSR                0x00007F80
//#define DM_CSR2                 0x00007F99

//#define STM8_FLASH_EOF          0x04
//#define STM8_FLASH_WR_PG_DIS    0x01
//#define STM8_FLASH_HVOFF        0x40

//#define PAGE_BLOCK_SIZE_64      64
//#define PAGE_BLOCK_SIZE_128     128

//static const uint8_t OPT_UNL[16] = {0x00,0x00,0xFF,0,0xFF,0,0xFF,0,0xFF,0,0xFF,0,0xFF,0,0xFF,0x55};
//static const uint8_t OPT_LCK[16] = {0xAA,0x00,0xFF,0,0xFF,0,0xFF,0,0xFF,0,0xFF,0,0xFF,0,0xFF,0x55};



uint16_t s_STM8_SerialType = 0;      /* 0 = STM8S, 1 = STM8L */  
uint16_t s_STM8_BlockSize = 64;      /* 块大小，64或者128字节 */
uint16_t s_STM8_HVOFF = 0;           /* 等待完成的标志选择 */

uint32_t s_STM8_FlashSize = 32 * 1024;      /* FLASH 容量 */
uint32_t s_STM8_EEPromSize = 32 * 1024;     /* EEPROM 容量 */

//#if defined (STM8S208) || defined(STM8S207) || defined(STM8S007) || defined(STM8S105) || 
//    defined(STM8S005) || defined (STM8AF52Ax) || defined (STM8AF62Ax) || defined(STM8AF626x)
//    FLASH_FLAG_HVOFF     = (uint8_t)0x40,     /*!< End of high voltage flag */
//#endif /* STM8S208, STM8S207, STM8S105, STM8AF62Ax, STM8AF52Ax, STM8AF626x */

#define STM8_ERASE_BLOCK_TIMEOUT     100    /* 100ms */

/*
*********************************************************************************************************
*    函 数 名: STM8_FLASH_WaitForLastOperation
*    功能说明: 等待内部写操作完成.   STM8_FLASH_WaitForLastOperation(FLASH_MEMTYPE_PROG);
*    形    参: _uiTimeout : 超时时间，ms
*    返 回 值:
*********************************************************************************************************
*/
uint8_t STM8_FLASH_WaitForLastOperation(uint8_t FLASH_MemType, uint32_t _uiTimeout)
{
    uint32_t re = 0;
    int32_t s_time;
        
    s_time = bsp_GetRunTime();
    
    if (FLASH_MemType == FLASH_MEMTYPE_PROG)
    {
        while (1)
        {
            if (s_STM8_SerialType == STM8S)
            {
                re = SWIM_ReadByte(STM8S_FLASH_IAPSR);
            }
            else if (s_STM8_SerialType == STM8L)
            {
                re = SWIM_ReadByte(STM8L_FLASH_IAPSR);
            }

            if (re & (STM8_FLASH_IAPSR_EOP | STM8_FLASH_IAPSR_WR_PG_DIS))
            {
                re = 1;
                break;
            }                
    
            if (bsp_CheckRunTime(s_time) >= _uiTimeout)
            {
                re = 0;
                break;
            }
        }
        return re;
    }
    else if (FLASH_MemType == FLASH_MEMTYPE_DATA)   /* EEPROM 的判断条件复杂些 */
    {
        while (1)
        {            
            if (s_STM8_SerialType == STM8S)
            {
                re = SWIM_ReadByte(STM8S_FLASH_IAPSR);
            }
            else if (s_STM8_SerialType == STM8L)
            {
                re = SWIM_ReadByte(STM8L_FLASH_IAPSR);
            }

            if (s_STM8_HVOFF == 1)
            {
                if (re & (STM8_FLASH_IAPSR_HVOFF | STM8_FLASH_IAPSR_WR_PG_DIS))
                {
                    re = 1;
                    break;
                }
            }
            else
            {
                if (re & (STM8_FLASH_IAPSR_EOP | STM8_FLASH_IAPSR_WR_PG_DIS))
                {
                    re = 1;
                    break;
                }                
            }
            
            if (bsp_CheckRunTime(s_time) >= _uiTimeout)
            {
                re = 0;
                break;
            }
        }
        return re;
    }
    
    return 0;
}    

/*
*********************************************************************************************************
*    函 数 名: STM8_WaitIAPSR_Flag
*    功能说明: 等待内部操作完成. 读STM8S_FLASH_IAPSR
*    形    参:  _Flag : 判断标志位
*               _BitValue : 0或1，表示返回的条件
*               _uiTimeout : 超时时间，ms
*    返 回 值: 0 超时，1 成功
*********************************************************************************************************
*/
uint8_t STM8_WaitIAPSR_Flag(uint8_t _Flag, uint8_t _BitValue, uint32_t _uiTimeout)
{
    uint8_t re = 0;
    int32_t s_time;
        
    s_time = bsp_GetRunTime();
    
    while (1)
    {
        if (s_STM8_SerialType == STM8S)
        {
            re = SWIM_ReadByte(STM8S_FLASH_IAPSR);
        }
        else if (s_STM8_SerialType == STM8L)
        {
            re = SWIM_ReadByte(STM8L_FLASH_IAPSR);
        }

        if (_BitValue == 0)
        {
            if ((re & _Flag) == 0)
            {
                re = 1;
                break;
            } 
        }
        else
        {
            if ((re & _Flag) == _Flag)
            {
                re = 1;
                break;
            }            
        }
         

        if (bsp_CheckRunTime(s_time) >= _uiTimeout)
        {
            re = 0;
            break;
        }
    }
    return re;
}    

/*
*********************************************************************************************************
*    函 数 名: STM8_FLASH_Unlock
*    功能说明: 解锁允许写flash和eeprom。 STM8S、STM8L个系列均相同
*    形    参: FlashAddr : 地址
*    返 回 值: 无
*********************************************************************************************************
*/ 
void STM8_FLASH_Unlock(void)
{        
    if (s_STM8_SerialType == STM8S)
    {
        /* Unlock program memory */
        SWIM_WriteByte(STM8S_FLASH_PUKR, STM8_FLASH_RASS_KEY1);
//        bsp_DelayUS(50);
        
