armfly/H7-TOOL_STM32H7_App/User/programmer/stm8_flash.c
        SWIM_WriteByte(STM8S_FLASH_PUKR, STM8_FLASH_RASS_KEY2);
//        bsp_DelayUS(50);
        
        /* Unlock data memory */
        /* Warning: keys are reversed on data memory !!! */
        SWIM_WriteByte(STM8S_FLASH_DUKR, STM8_FLASH_RASS_KEY2);
//        bsp_DelayUS(50);
        
        SWIM_WriteByte(STM8S_FLASH_DUKR, STM8_FLASH_RASS_KEY1);        
//        bsp_DelayUS(50);        
    }
    else if (s_STM8_SerialType == STM8L)
    {
        /* Unlock program memory */
        SWIM_WriteByte(STM8L_FLASH_PUKR, STM8_FLASH_RASS_KEY1);
//        bsp_DelayUS(50);
        
        SWIM_WriteByte(STM8L_FLASH_PUKR, STM8_FLASH_RASS_KEY2);
//        bsp_DelayUS(50);
       
        /* Unlock data memory */
        /* Warning: keys are reversed on data memory !!! */
        SWIM_WriteByte(STM8L_FLASH_DUKR, STM8_FLASH_RASS_KEY2);
//        bsp_DelayUS(50);
        
        SWIM_WriteByte(STM8L_FLASH_DUKR, STM8_FLASH_RASS_KEY1); 
//        bsp_DelayUS(50);        
    }
    
    STM8_WaitIAPSR_Flag(STM8_FLASH_IAPSR_DUL | STM8_FLASH_IAPSR_PUL, 1,  20);
}

/*
*********************************************************************************************************
*    函 数 名: STM8_FLASH_Lock
*    功能说明: Locks the program or data EEPROM memory
*    形    参: _FLASH_MemType : FLASH_MEMTYPE_PROG、FLASH_MEMTYPE_DATA
*    返 回 值: 无
*********************************************************************************************************
*/ 
void STM8_FLASH_Lock(uint32_t FlashAddr)
{  
    FLASH_MemType_TypeDef FLASH_MemType; 
    
    if (FlashAddr < 0x8000)
    {
        FLASH_MemType = FLASH_MEMTYPE_DATA;
    }
    else
    {
        FLASH_MemType = FLASH_MEMTYPE_PROG;
    }
    
    if (s_STM8_SerialType == STM8S)
    {
        uint8_t iapsr;
        
        iapsr = SWIM_ReadByte(STM8S_FLASH_IAPSR);        
        iapsr &= (uint8_t)FLASH_MemType;
        
        /* Lock memory */
        SWIM_WriteByte(STM8S_FLASH_IAPSR, iapsr);
    }
    else if (s_STM8_SerialType == STM8L)
    {
        uint8_t iapsr;
        
        iapsr = SWIM_ReadByte(STM8L_FLASH_IAPSR);        
        iapsr &= (uint8_t)FLASH_MemType;
        
        /* Lock memory */
        SWIM_WriteByte(STM8L_FLASH_IAPSR, iapsr);
    }    
}

/*
*********************************************************************************************************
*    函 数 名: STM8_WriteReg_CR2
*    功能说明: 写CR2寄存器.  比如  STM8_WriteReg_CR2(STM8_FLASH_CR2_OPT)
*    形    参: _value : 0禁止， 1是使能
*    返 回 值: 无
*********************************************************************************************************
*/ 
void STM8_WriteReg_CR1(uint8_t _value)
{
    uint8_t buf[1];
    
    buf[0] = _value;
    if (s_STM8_SerialType == STM8S)
    {
        SWIM_WriteBuf(STM8S_FLASH_CR1, buf, 1);
    }
    else if (s_STM8_SerialType == STM8L)
    { 
        SWIM_WriteBuf(STM8L_FLASH_CR1, buf, 1);            
    } 
}

/*
*********************************************************************************************************
*    函 数 名: STM8_WriteReg_CR2
*    功能说明: 写CR2寄存器.  比如  STM8_WriteReg_CR2(STM8_FLASH_CR2_OPT)
*    形    参: _value : 0禁止， 1是使能
*    返 回 值: 无
*********************************************************************************************************
*/ 
void STM8_WriteReg_CR2(uint8_t _value)
{
    uint8_t buf[2];
    
    buf[0] = _value;
    buf[1] = ~buf[0];
    if (s_STM8_SerialType == STM8S)
    {
        SWIM_WriteBuf(STM8S_FLASH_CR2, buf, 2);
    }
    else if (s_STM8_SerialType == STM8L)
    { 
        SWIM_WriteBuf(STM8L_FLASH_CR2, buf, 1);            
    } 
}
        
/*
*********************************************************************************************************
*    函 数 名: STM8_FLASH_EraseBlock
*    功能说明: Erases a block in the program or data memory.
*    形    参: FlashAddr : 绝对地址。 必须是block首地址
*              FLASH_MemType : FLASH_MEMTYPE_PROG、FLASH_MEMTYPE_DATA
*    返 回 值: 无
*********************************************************************************************************
*/ 
void STM8_FLASH_EraseBlock(uint32_t FlashAddr)
{
    uint32_t BlockAddr = 0;
    const uint8_t zefo[4] = {0,0,0,0};
  
    BlockAddr = (FlashAddr / s_STM8_BlockSize) * s_STM8_BlockSize;
    
    /* Enable erase block mode */
    STM8_WriteReg_CR2(STM8_FLASH_CR2_ERASE);   
    
    SWIM_WriteBuf(BlockAddr, (uint8_t *)zefo, 4);   
    
    STM8_WaitIAPSR_Flag(STM8_FLASH_IAPSR_EOP, 1, 10);    
    
//    if (BlockAddr < 0x8000)
//    {
//        STM8_FLASH_WaitForLastOperation(FLASH_MEMTYPE_DATA, 100);
//    }
//    else
//    {
//        STM8_FLASH_WaitForLastOperation(FLASH_MEMTYPE_PROG, 100);
//    }
}

/*
*********************************************************************************************************
*    函 数 名: STM8_FLASH_ProgramBlock
*    功能说明: Programs a memory block
*    形    参: FlashAddr : 绝对地址。 必须是block首地址
*              Buffer : Pointer to buffer containing source data.
*    返 回 值: 0:失败  1:成功
*********************************************************************************************************
*/ 
uint8_t STM8_FLASH_ProgramBlock(uint32_t FlashAddr, uint8_t *Buffer)
{  
    FLASH_MemType_TypeDef FLASH_MemType;
    uint32_t BlockAddr = 0;    
    uint8_t re;

    BlockAddr = (FlashAddr / s_STM8_BlockSize) * s_STM8_BlockSize;
    if (BlockAddr < 0x8000)
    {
        FLASH_MemType = FLASH_MEMTYPE_DATA;
    }
    else
    {
        FLASH_MemType = FLASH_MEMTYPE_PROG;
    }    
    
    if (s_STM8_SerialType == STM8L)
    {
        STM8_WriteReg_CR2(STM8_FLASH_CR2_PRG); 
    }
    else
    {
        STM8_WriteReg_CR1(STM8_FLASH_PROGRAMTIME_TPROG);     /* 设置快速编程模式 */
        bsp_DelayUS(100);
        STM8_WriteReg_CR2(STM8_FLASH_CR2_FPRG);        
    } 

    re = SWIM_WriteBuf(BlockAddr, Buffer, s_STM8_BlockSize);
    if (re == 0) goto err_quit;
    bsp_DelayUS(100);
    
    #if 1
        re = STM8_FLASH_WaitForLastOperation(FLASH_MemType, STM8_ERASE_BLOCK_TIMEOUT);
    #else        
        STM8_WaitIAPSR_Flag(STM8_FLASH_IAPSR_EOP, 1,  20);
    #endif
    if (re == 0) goto err_quit;
        
    return 1;
    
err_quit:
    return 0;
}

