armfly/H7-TOOL_STM32H7_App/User/programmer/stm8_flash.c
/*
*********************************************************************************************************
*    函 数 名: STM8_FLASH_ProgramBuf
*    功能说明: Programs a memory block
*    形    参: _FlashAddr : 绝对地址。 
*              _Buff : Pointer to buffer containing source data.
*              _Size : 数据大小，可以大于1个block
*    返 回 值: 0 : 出错;  1 : 成功
*********************************************************************************************************
*/ 
uint8_t STM8_FLASH_ProgramBuf(uint32_t _FlashAddr, uint8_t *_Buff, uint32_t _Size)
{
    uint32_t i;
    uint32_t BlockAddr = 0;
    uint8_t buf0[128];        /* 一般就是64或者128 */
    uint8_t *pSrc;
    uint32_t size;
    uint8_t re = 0;
    
    pSrc = _Buff;
    
    /* 计算block首地址 */
    BlockAddr = (_FlashAddr / s_STM8_BlockSize) * s_STM8_BlockSize;  

    /* 烧录第一个block */    
    if (BlockAddr != _FlashAddr)
    {
        uint16_t offset;
        uint16_t len;
        
        re = SWIM_ReadBuf(BlockAddr, buf0, s_STM8_BlockSize);
        if (re == 0)
        {
            goto err_quit;
        }
        
        if (CheckBlankBuf((char *)buf0, s_STM8_BlockSize, 0) == 0)
        {
            STM8_FLASH_EraseBlock(BlockAddr);
        }
        
        offset = _FlashAddr - BlockAddr;
        
        if (offset + _Size < s_STM8_BlockSize)
        {
            len = _Size;
        }
        else 
        {
            len = s_STM8_BlockSize - offset;
        }
        for (i = 0; i < len; i++)
        {
            buf0[i + offset] = *pSrc++;
            
            _Size--;
            
            _FlashAddr++;
        }        

        re = STM8_FLASH_ProgramBlock(BlockAddr, buf0);
        if (re == 0)
        {
            goto err_quit;
        }        
    }
    
    /* 烧录中间block */
    size = _Size;
    for (i = 0; i < size / s_STM8_BlockSize; i++)
    {
//        re = SWIM_ReadBuf(BlockAddr, buf0, s_STM8_BlockSize);
//        if (re == 0)
//        {
//            goto err_quit;
//        }
//        
//        if (CheckBlankBuf((char *)buf0, s_STM8_BlockSize, 0) == 0)
//        {
//            STM8_FLASH_EraseBlock(BlockAddr);
//        }
        
        re = STM8_FLASH_ProgramBlock(_FlashAddr, pSrc); 
        if (re == 0)
        {
            goto err_quit;
        }
        
        pSrc += s_STM8_BlockSize; 
        _Size -= s_STM8_BlockSize;
        _FlashAddr += s_STM8_BlockSize;
    }
    
    /* 烧录最后一个block */
    if (_Size > 0)
    {
        re = SWIM_ReadBuf(BlockAddr, buf0, s_STM8_BlockSize);
        if (re == 0)
        {
            goto err_quit;
        }
        
        if (CheckBlankBuf((char *)buf0, s_STM8_BlockSize, 0) == 0)
        {
            STM8_FLASH_EraseBlock(BlockAddr);
        }        
        
        for (i = 0; i < _Size; i++)
        {
            buf0[i] = *pSrc++;
        }                
        re = STM8_FLASH_ProgramBlock(_FlashAddr, buf0); 
        if (re == 0)
        {
            goto err_quit;
        }        
    }
    
    return 1;

err_quit:
    return 0;
}    

/*
*********************************************************************************************************
*    函 数 名: STM8_FLASH_ProgramOptionBytes
*    功能说明: Programs option byte
*    形    参: _AddrBuf : 地址数组，大端模式排列.
*              _AddrLen : _AddrLen
*              _DataBuf : 输入数据
*              _DataLen : 数据大小，可以大于1个block
*    返 回 值: 0 : 出错;  1 : 成功
*********************************************************************************************************
*/ 
uint8_t STM8_ProgramOptionBytes(uint8_t *_AddrBuf, uint16_t _AddrLen, uint8_t *_DataBuf, uint16_t _DataLen)
{
    uint8_t re;
    uint16_t Address;
    uint16_t LastAddress;
    uint8_t LastData;
    
    if (_DataLen == 0 || _AddrLen == 0 || (_AddrLen % 2) != 0)
    {
        goto err_quit;
    }
     
    while (_AddrLen)
    {            
        STM8_FLASH_Unlock();                    /* 允许写Flash和EEProm */                        
        STM8_WriteReg_CR2(STM8_FLASH_CR2_OPT);  /* 编程OPT */
        
        Address = BEBufToUint16(_AddrBuf); 
        _AddrBuf += 2;
        
        bsp_DelayUS(200);
                    
        if (Address == 0xFFFF)  /* 上一个字节取反写入 */
        {
            re = SWIM_WriteByte(LastAddress + 1, ~LastData);
            if (re == 0)
            {
                goto err_quit;
            }
        }
        else
        {
            LastAddress = Address;
            LastData = *_DataBuf;  
            
            re = SWIM_WriteByte(LastAddress, LastData);
            if (re == 0)
            {
                goto err_quit;
            } 
            
            _DataBuf++;
        }
        
        _AddrLen -= 2;
                    
        /* STM8L151 实测寄存器变化  2A 2A 2A -> 4E 判断结束 */
        bsp_DelayUS(500);
        if (Address == 0x4800)
        {
            STM8_WaitIAPSR_Flag(STM8_FLASH_IAPSR_EOP, 1, 1000);      /* 1000ms超时 */
        }
        else
        {
            STM8_WaitIAPSR_Flag(STM8_FLASH_IAPSR_EOP, 1, 50);       /* 50ms超时 */
        }
        bsp_DelayUS(50);     
        STM8_WriteReg_CR2(0);                   /* 不确定是否需要这句话 解除编程操作*/  
        bsp_DelayUS(50); 
    }   

    return 1;   /* 成功 */
err_quit:
    return 0;
}

/*
*********************************************************************************************************
*    函 数 名: STM8_FLASH_EraseChip
*    功能说明: 擦除全片，FLASH (PROG).  事先需要unlock
*    形    参: FlashAddr : 绝对地址。 0x08000 或者 0x04000
*              FLASH_MemType : FLASH_MEMTYPE_PROG、FLASH_MEMTYPE_DATA
*    返 回 值: 0 失败  1 成功
*********************************************************************************************************
*/ 
uint8_t STM8_FLASH_EraseChip(uint32_t _FlashAddr)
{
#if 0
    uint8_t value;
    
    value = 0xAA;
    STM8_ProgramOptionBytes(0x4800, &value, 1);
    
    bsp_DelayUS(100);
    
    SWIM_EntrySequence();
       
    STM8_ProgramOptionBytes(0x4800, &value, 1);
    
    bsp_DelayUS(100);
#else    
    uint32_t i;
    const uint8_t zefo[4] = {0,0,0,0};
    uint8_t re;
    uint32_t FlashSize;   
  
