armfly/H7-TOOL_STM32H7_App/User/programmer/stm8_flash.c
    STM8_FLASH_Unlock();
    if (_FlashAddr == 0x08000)
    {
        FlashSize = s_STM8_FlashSize;
    }
    else if (_FlashAddr == 0x04000)
    {
        FlashSize = s_STM8_EEPromSize;
    }
    else
    {
        goto err_quit;
    }
    
    for (i = 0; i < FlashSize / s_STM8_BlockSize; i++)
    {
        STM8_WriteReg_CR2(STM8_FLASH_CR2_ERASE);   
        
        re = SWIM_WriteBuf(_FlashAddr, (uint8_t *)zefo, 4);   
        if (re == 0)
        {
            goto err_quit;
        }
        
        re = STM8_WaitIAPSR_Flag(STM8_FLASH_IAPSR_EOP, 1, 10);
        if (re == 0)
        {
            goto err_quit;
        }       
        
        _FlashAddr += s_STM8_BlockSize;
    }
    
    return 1;
    
err_quit:
    return 0;
#endif    
}

/*
*********************************************************************************************************
*    函 数 名: STM8_FLASH_EraseSector
*    功能说明: 擦除扇区
*    形    参: FlashAddr : 绝对地址。 0x08000 或者 0x04000
*              FLASH_MemType : FLASH_MEMTYPE_PROG、FLASH_MEMTYPE_DATA
*    返 回 值: 0 失败  1 成功
*********************************************************************************************************
*/ 
uint8_t STM8_FLASH_EraseSector(uint32_t _FlashAddr)
{
    const uint8_t zefo[4] = {0,0,0,0};
    uint8_t re;  
  
    STM8_FLASH_Unlock();
    
    STM8_WriteReg_CR2(STM8_FLASH_CR2_ERASE);   
    
    re = SWIM_WriteBuf(_FlashAddr, (uint8_t *)zefo, 4);   
    if (re == 0)
    {
        goto err_quit;
    }
    
    re = STM8_WaitIAPSR_Flag(STM8_FLASH_IAPSR_EOP, 1, 10);
    if (re == 0)
    {
        goto err_quit;
    }       
    return 1;
    
err_quit:
    return 0;  
}

/*
*********************************************************************************************************
*    函 数 名: STM8_FLASH_ReadBuf
*    功能说明: 读flash
*    形    参: _FlashAddr : 绝对地址。 
*              _Buff : Pointer to buffer containing source data.
*              _Size : 数据大小，可以大于1个block
*    返 回 值: 0 : 出错;  1 : 成功
*********************************************************************************************************
*/ 
uint8_t STM8_FLASH_ReadBuf(uint32_t _FlashAddr, uint8_t *_Buff, uint32_t _Size)
{
    uint32_t i;
    uint8_t *pSrc;
    uint32_t size;
    uint8_t re = 0;
    
    pSrc = _Buff;

    size = _Size;
    for (i = 0; i < size / s_STM8_BlockSize; i++)
    {
        re = SWIM_ReadBuf(_FlashAddr, pSrc, s_STM8_BlockSize);
        if (re == 0)
        {
            goto err_quit;
        }
        
        pSrc += s_STM8_BlockSize; 
        _Size -= s_STM8_BlockSize;
        _FlashAddr += s_STM8_BlockSize;
    }
    
    if (_Size > 0)
    {
        re = SWIM_ReadBuf(_FlashAddr, pSrc, _Size);
        if (re == 0)
        {
            goto err_quit;
        }        
    }
    
    return 1;

err_quit:
    return 0;
}    

/*
*********************************************************************************************************
*    函 数 名: STM8_UnlockReadProtect
*    功能说明: 解除读保护. 逻辑分析仪跟踪ST-LINK解锁过程获得的数据。
*    形    参: 无
*    返 回 值: 1表示OK, 0表示出错
*********************************************************************************************************
*/
uint8_t STM8_UnlockReadProtect(void)
{
    uint8_t buf[8];
    uint8_t re;
    
//    SWIM_WriteByte(0x7F80, 0xB0);       /* 切换到速模式 */
//    
//    g_HighSpeed = 1;                    
//    
//    bsp_DelayUS(400);                   /* 延迟400us */
//    
//    SWIM_WriteByte(0x7F80, 0xB4);       /*  */
//    
//    bsp_DelayUS(200);                   /* 延迟200us */
    
//    SWIM_WriteByte(STM8_CLK_CKDIVR, 0x00);       /* STM8_CLK_CKDIVR = 0x50C6 */
//    
//    SWIM_ReadBuf(0x4FFC, buf, 4);       /* 返回 0x67 0x67 0x10 0x03 */
//    
//    bsp_DelayMS(5);                     /* 延迟5ms */
//    
//    SWIM_ReadByte(0x505F);              /* 返回 0x80 */    
    
    
    re = SWIM_ReadByte(0x4800);              /* 返回 0x71*/
    if (re == 0)
    
    bsp_DelayUS(500);                   /* 延迟500us */
    
    // 42681
    SWIM_WriteByte(STM8S_FLASH_PUKR, 0x56);       /* STM8S_FLASH_PUKR = 0x5062 */
    
    bsp_DelayUS(260);                   /* 延迟260us */
    
    // 43058
    SWIM_WriteByte(STM8S_FLASH_PUKR, 0xAE);       /* STM8S_FLASH_PUKR = 0x5062 */
    
    bsp_DelayUS(260);                   /* 延迟260us */
    
    SWIM_WriteByte(STM8S_FLASH_DUKR, 0xAE);       /* STM8S_FLASH_DUKR = 0x5064 */
     bsp_DelayUS(260); 
    SWIM_WriteByte(STM8S_FLASH_DUKR, 0x56); 
     bsp_DelayUS(260); 
     
    
//#define STM8_FLASH_IAPSR_HVOFF     ((uint8_t)0x40) /*!< End of high voltage flag mask */
//#define STM8_FLASH_IAPSR_DUL       ((uint8_t)0x08) /*!< Data EEPROM unlocked flag mask */
//#define STM8_FLASH_IAPSR_EOP       ((uint8_t)0x04) /*!< End of operation flag mask */
//#define STM8_FLASH_IAPSR_PUL       ((uint8_t)0x02) /*!< Flash Program memory unlocked flag mask */
//#define STM8_FLASH_IAPSR_WR_PG_DIS ((uint8_t)0x01) /*!< Write attempted to protected page mask */
    SWIM_ReadByte(0x505F);              /* 返回 0xCA  1100 1010    */
    
    bsp_DelayUS(500); 
    
    buf[0] = STM8_FLASH_CR2_OPT;          /* STM8_FLASH_CR2_OPT = 0x80 */
    buf[1] = ~buf[0]; 
    SWIM_WriteBuf(STM8S_FLASH_CR2, buf, 2);    /* STM8S_FLASH_CR2 =  0x505B */
    
    SWIM_WriteByte(0x4800, 0); 
    
//    SWIM_ReadByte(0x505F);      /* 返回 AB 1010 1011  STM8S_FLASH_IAPSR = 0x505F */
//    SWIM_ReadByte(0x505F);      /* 返回 AB 1010 1011 */
//    
//    SWIM_ReadByte(0x505F);      /* 返回 AA 1010 1010 */
//    SWIM_ReadByte(0x505F);      /* 返回 AA 1010 1010 */
//        
//    // 48063
//    SWIM_ReadByte(0x505F);      /* 返回 4E 0100 1110 */
    
    STM8_WaitIAPSR_Flag(STM8_FLASH_IAPSR_WR_PG_DIS | STM8_FLASH_IAPSR_EOP, 1, 50);

    bsp_DelayUS(500); 
    buf[0] = 0x00; 
    buf[1] = 0xFF; 
    SWIM_WriteBuf(STM8S_FLASH_CR2, buf, 2);     /* STM8S_FLASH_CR2 =  0x505B */
    
    // 50261
    SWIM_WriteByte(STM8S_FLASH_PUKR, 0x56);     /* STM8S_FLASH_PUKR = 0x5062 */
    bsp_DelayUS(1500); 
    // 50661
    SWIM_WriteByte(STM8S_FLASH_PUKR, 0xAE);         
    bsp_DelayUS(300);
    //51072
    SWIM_WriteByte(STM8S_FLASH_DUKR, 0xAE);               /* STM8S_FLASH_DUKR = 0x5064 */ 
  
// 51432.US   
    SWIM_WriteByte(STM8S_FLASH_DUKR, 0x56);
    
    bsp_DelayUS(200); 
    SWIM_ReadByte(0x505F);      /* 返回  */
    
    bsp_DelayUS(500);  
    buf[0] = STM8_FLASH_CR2_OPT;          /* STM8_FLASH_CR2_OPT = 0x80 */
    buf[1] = ~buf[0];           /* 7F */
    SWIM_WriteBuf(STM8S_FLASH_CR2, buf, 2);    /* STM8S_FLASH_CR2 =  0x505B */    

    bsp_DelayUS(200);
    SWIM_WriteByte(0x4801, 0x00); 
//    SWIM_ReadByte(0x505F);      /* 返回 2A  0010 1010 */
//    SWIM_ReadByte(0x505F);      /* 返回 2A  0010 1010 */
//    SWIM_ReadByte(0x505F);      /* 返回 6A  0110 1010 */
//    SWIM_ReadByte(0x505F);      /* 返回 4E  0100 1110 */
    STM8_WaitIAPSR_Flag(STM8_FLASH_IAPSR_WR_PG_DIS | STM8_FLASH_IAPSR_EOP, 1, 50);
    
    // 56544
    SWIM_WriteByte(0x4802, 0xFF); 
//    SWIM_ReadByte(0x505F);      /* 返回 4E */
//    SWIM_ReadByte(0x505F); 
//    SWIM_ReadByte(0x505F); 
//    SWIM_ReadByte(0x505F); 
//    SWIM_ReadByte(0x505F); 
    STM8_WaitIAPSR_Flag(STM8_FLASH_IAPSR_WR_PG_DIS | STM8_FLASH_IAPSR_EOP, 1, 50);
    
    // 60.01877
    buf[0] = 0x00; 
    buf[1] = ~buf[0]; 
    SWIM_WriteBuf(STM8S_FLASH_CR2, buf, 2); /* STM8S_FLASH_CR2 =  0x505B */   


    bsp_DelayUS(900);
    
    
    //61129 
    SWIM_WriteByte(0x5062, 0x56); 
    bsp_DelayUS(200);
    // 61526
    SWIM_WriteByte(0x5062, 0xAE); 
    bsp_DelayUS(200);
    // 61915
    SWIM_WriteByte(0x5064, 0xAE);
    bsp_DelayUS(200);
    // 62217
    SWIM_WriteByte(0x5064, 0x56);  
    bsp_DelayUS(200);   

    // 62527
    SWIM_ReadByte(0x505F);      /* 返回 4A  0100 1010  */
    
    // 62992
    bsp_DelayUS(500);  
    buf[0] = STM8_FLASH_CR2_OPT;          /* STM8_FLASH_CR2_OPT = 0x80 */
    buf[1] = ~buf[0];           /* 7F */
    SWIM_WriteBuf(STM8S_FLASH_CR2, buf, 2);    /* STM8S_FLASH_CR2 =  0x505B */ 
    
    return 1;
}

/***************************** 安富莱电子 www.armfly.com (END OF FILE) *********************************/
